In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [12]:
##CREATING A DATAFRAME

df1={'Name':["Akshay","Anit","Rahul","Amit","Saptarshi","Yuvika"],
    'Marks':[90,91,92,93,95,96],
    'Branch':['DSE','CSE','EEE','ECE','EEE','BIO']
    
}
df1

{'Name': ['Akshay', 'Anit', 'Rahul', 'Amit', 'Saptarshi', 'Yuvika'],
 'Marks': [90, 91, 92, 93, 95, 96],
 'Branch': ['DSE', 'CSE', 'EEE', 'ECE', 'EEE', 'BIO']}

In [15]:
#specifying the index in the dataframe
df=new=pd.DataFrame(df1,index=[1,2,3,4,5,6])
df

        Name  Marks Branch
1     Akshay     90    DSE
2       Anit     91    CSE
3      Rahul     92    EEE
4       Amit     93    ECE
5  Saptarshi     95    EEE
6     Yuvika     96    BIO

In [17]:
#creation of new column
df["Age"]=[20,20,20,20,19,19]
df

        Name  Marks Branch  Age
1     Akshay     90    DSE   20
2       Anit     91    CSE   20
3      Rahul     92    EEE   20
4       Amit     93    ECE   20
5  Saptarshi     95    EEE   19
6     Yuvika     96    BIO   19

In [19]:
#Print minimum marks and maximum marks.
#Print mean and median of marks.

print("Minimum marks is: ",df['Marks'].min())
print("Maximum marks is: ",df['Marks'].max())
print("Mean marks is: ",df['Marks'].mean())
print("Median marks is: ",df['Marks'].median())

Minimum marks is:  90
Maximum marks is:  96
Mean marks is:  92.83333333333333
Median marks is:  92.5

In [21]:
#STUDENT WITH HIGHEST MARKS
student=df.loc[df['Marks'].idxmax(),'Name']
print("student name is: ",student)

student name is:  Yuvika

In [33]:
#NAME OF STUDENTS WITH MARKS >90 and <95
dfnew=df[df['Marks']>91]
dfnew1=dfnew[dfnew['Marks']<95]
#dfnew.shape gives the number of rows and columns.
print("Count is: ",dfnew1.shape[0])
dfnew1

Count is:  2

    Name  Marks Branch  Age
3  Rahul     92    EEE   20
4   Amit     93    ECE   20

In [31]:
#PRINTING COLUMN NAMES
print("Columns name is: ",df.columns)

Columns name is:  Index(['Name', 'Marks', 'Branch', 'Age'], dtype='object')

In [32]:
#PRINTING COLUMN NAMES IN DIFFERENT LINES
for col in df.columns:
    print(col)

Name
Marks
Branch
Age

In [35]:
#SHOW THE 2ND AND 3RD ROW
df.iloc[2:4]

    Name  Marks Branch  Age
3  Rahul     92    EEE   20
4   Amit     93    ECE   20

In [39]:
#SHOW THE contents of 2ND AND 3RD COLUMN
print("Contents of 2nd column: ",df.columns[2])
df[df.columns[2]]
print("Contents of 3rd column: ",df.columns[3])
df[df.columns[3]]

Contents of 2nd column:  Branch
Contents of 3rd column:  Age

1    20
2    20
3    20
4    20
5    19
6    19
Name: Age, dtype: int64

In [40]:
#CONCEPTS TO BE REMEMBERED